jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/drivers/drv_w5500.c
/**
  *             Copyright (C) SOJO Electric CO., Ltd. 2017-2018. All right reserved.
  * @file:      w5500.c
  * @brief:     The driver of w5500.
  * @version:   V1.0.0
  * @author:    Lexun
  * @date:      2017-10-26
  * @update:    [2017-12-07][Lexun][make the code cleanup]
  */


/* INCLUDE FILES -------------------------------------------------------------*/
#include <rtthread.h>
#include "stm32f4xx_hal.h"
#include "drv_w5500.h"
#include "drv_w5500_conf.h"
#include "drv_spi.h"
#include "string.h"
#include "drv_gpio.h"
#include "common_data.h"
#include ".\MultiThread\multi_thread.h"
#include "stm32f4xx_ll_spi.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_dma.h"

/* PRIVATE VARIABLES ---------------------------------------------------------*/
//static struct spi_w5500_device device_w5500; 
static struct rt_device_pin *w5500_pin; 
static LL_DMA_InitTypeDef LL_DMA_InitStructure;
static LL_DMA_InitTypeDef LL_DMA_InitStructure_Write;

#define DATA_BUF_SIZE   1024
uint8_t *pTmpBuf1;
uint8_t *pTmpBuf2;
/* PRIVATE FUNCTION PROTOTYPES -----------------------------------------------*/
/**
  * @brief  w5500 device select.
  * @param  None.
  * @retval None.
  */
static void w5500_cs_select(void)
{
    pin_status[INDEX_W5500_CS].status = GPIO_PIN_RESET;			
    rt_device_write(&w5500_pin->parent, 0, &pin_status[INDEX_W5500_CS], sizeof(struct rt_device_pin_status));
}

/**
  * @brief  w5500 device deselect.
  * @param  None.
  * @retval None.
  */
static void w5500_cs_deselect(void)
{
    pin_status[INDEX_W5500_CS].status = GPIO_PIN_SET;			
    rt_device_write(&w5500_pin->parent, 0, &pin_status[INDEX_W5500_CS], sizeof(struct rt_device_pin_status));
}

/**
  * @brief  w5500 device reset.
  * @param  None.
  * @retval None.
  */
static void w5500_reset(void)
{	
    pin_status[INDEX_W5500_RESET].status = GPIO_PIN_RESET;			
    rt_device_write(&w5500_pin->parent, 0, &pin_status[INDEX_W5500_RESET], sizeof(struct rt_device_pin_status));
    rt_thread_delay(5); // delay 5 ms
    pin_status[INDEX_W5500_RESET].status = GPIO_PIN_SET;			
    rt_device_write(&w5500_pin->parent, 0, &pin_status[INDEX_W5500_RESET], sizeof(struct rt_device_pin_status));
    rt_thread_delay(800); // delay 1600 ms
}	

static void W5500_SetDefaultNetInfo( wiz_NetInfo* pNetinfo)
{

    pNetinfo->ip[0] =  192;
    pNetinfo->ip[1] =  168;
    pNetinfo->ip[2] =  10;
    pNetinfo->ip[3] =  1;
    

	
    pNetinfo->mac[0] = 0x00;
    pNetinfo->mac[1] = 0x80;
    pNetinfo->mac[2] = 0xE1;
    pNetinfo->mac[3] = *(rt_uint8_t*)(UID_BASE + 0);
    pNetinfo->mac[4] = *(rt_uint8_t*)(UID_BASE + 2);
    pNetinfo->mac[5] = *(rt_uint8_t*)(UID_BASE + 4);
    

    pNetinfo->sn[0] = 255;
    pNetinfo->sn[1] = 255;
    pNetinfo->sn[2] = 255;
    pNetinfo->sn[3] = 0;
    pNetinfo->gw[0] = 0;
    pNetinfo->gw[1] = 0;
    pNetinfo->gw[2] = 0;
    pNetinfo->gw[3] = 0;
    pNetinfo->dns[0] = 114;
    pNetinfo->dns[1] = 114;
    pNetinfo->dns[2] = 114;
    pNetinfo->dns[3] = 114;
    
   


}


/**
  * @brief  w5500 device config.
  * @param  None.
  * @retval None.
  */
static void w5500_config(void)
{
    wiz_NetInfo wiz_netinfo;
	uint8_t tmpstr[6];
//    if (g_EthW5500.ip[0] != 0)
//    {
//    memcpy(wiz_netinfo.mac, g_EthW5500.mac, 6);
//    memcpy(wiz_netinfo.ip, g_EthW5500.ip, 4);
//    memcpy(wiz_netinfo.sn , g_EthW5500.netmask, 4);
//    memcpy(wiz_netinfo.gw , g_EthW5500.gateway, 4);
//    memcpy(wiz_netinfo.dns, g_EthW5500.dns, 4);
//    }
//    else
    {
        W5500_SetDefaultNetInfo(&wiz_netinfo);
    }
			
	  // Setting default network information
		ctlnetwork(CN_SET_NETINFO, (void*)&wiz_netinfo);
	
	  // Get network configuration information
		ctlnetwork(CN_GET_NETINFO, (void*)&wiz_netinfo);

		// Display Network Information
		ctlwizchip(CW_GET_ID, (void*)tmpstr);
}

void spi_dma_write(uint8_t* Addref, uint8_t* pTxBuf, uint16_t tx_len)
{
//	rt_sem_take(&w5500_sem, RT_WAITING_FOREVER);
	
//	uint16_t i;
	memset(pTmpBuf1, 0, tx_len + 3);
    
	pTmpBuf1[0] = Addref[0];
	pTmpBuf1[1] = Addref[1];
	pTmpBuf1[2] = Addref[2];
    
//	for(i=0; i<tx_len; i++)
//		pTmpBuf1[3 + i] = pTxBuf[i];
    
    memcpy(pTmpBuf1 + 3, pTxBuf, tx_len);
   
    LL_DMA_InitStructure_Write.NbData =  (uint32_t)(tx_len + 3);
    
    /* Configure Tx DMA */
    LL_DMA_InitStructure_Write.Channel = LL_DMA_CHANNEL_0;
    LL_DMA_InitStructure_Write.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    LL_DMA_InitStructure_Write.MemoryOrM2MDstAddress = (uint32_t) pTmpBuf1;    
    LL_DMA_Init(DMA1, LL_DMA_STREAM_4, &LL_DMA_InitStructure_Write);
    
    /* Configure Rx DMA */
    LL_DMA_InitStructure_Write.Channel = LL_DMA_CHANNEL_0;
    LL_DMA_InitStructure_Write.Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY ;
    LL_DMA_InitStructure_Write.MemoryOrM2MDstAddress = (uint32_t) pTmpBuf1;    
    LL_DMA_Init(DMA1, LL_DMA_STREAM_3, &LL_DMA_InitStructure_Write);
    
    LL_DMA_DisableFifoMode(DMA1, LL_DMA_STREAM_3);
    LL_DMA_DisableFifoMode(DMA1, LL_DMA_STREAM_4);

    w5500_cs_select();
    
    LL_DMA_EnableStream(DMA1, LL_DMA_STREAM_3);
    LL_DMA_EnableStream(DMA1, LL_DMA_STREAM_4);
    
    LL_SPI_EnableDMAReq_RX(SPI2);
    LL_SPI_EnableDMAReq_TX(SPI2);    
    LL_SPI_Enable(SPI2);
    /* Waiting the end of Data transfer */
    while (!LL_DMA_IsActiveFlag_TC4(DMA1));
    while (!LL_DMA_IsActiveFlag_TC3(DMA1));
    
    w5500_cs_deselect();
    
    LL_DMA_ClearFlag_TC4(DMA1);
    LL_DMA_ClearFlag_TC3(DMA1);
  
    LL_SPI_DisableDMAReq_RX(SPI2);
    LL_SPI_DisableDMAReq_TX(SPI2);
    LL_SPI_Disable(SPI2);
	
//	rt_sem_release(&w5500_sem);
}

void spi_dma_read(uint8_t* Addref, uint8_t* pRxBuf, uint16_t rx_len)
{
//	rt_sem_take(&w5500_sem, RT_WAITING_FOREVER);
	
//	uint16_t i;
	memset(pTmpBuf1, 0, rx_len + 3);
	memset(pTmpBuf2, 0, rx_len + 3);
	pTmpBuf1[0] = Addref[0];
	pTmpBuf1[1] = Addref[1];
	pTmpBuf1[2] = Addref[2];
    
  
    LL_DMA_InitStructure.NbData =  rx_len + 3;
    /* Configure Tx DMA */
    LL_DMA_InitStructure.Channel = LL_DMA_CHANNEL_0;
    LL_DMA_InitStructure.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    LL_DMA_InitStructure.MemoryOrM2MDstAddress = (uint32_t) pTmpBuf1;    
    LL_DMA_Init(DMA1, LL_DMA_STREAM_4, &LL_DMA_InitStructure);
    
