jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/drivers/drv_w5500.c
    /* Configure Rx DMA */
    LL_DMA_InitStructure.Channel = LL_DMA_CHANNEL_0;
    LL_DMA_InitStructure.Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY ;
    LL_DMA_InitStructure.MemoryOrM2MDstAddress = (uint32_t) pTmpBuf2;
    
    LL_DMA_Init(DMA1, LL_DMA_STREAM_3, &LL_DMA_InitStructure);
    
     
    LL_SPI_EnableDMAReq_RX(SPI2);
    LL_SPI_EnableDMAReq_TX(SPI2);
           
    w5500_cs_select();
    
    LL_DMA_EnableStream(DMA1, LL_DMA_STREAM_3);
    LL_DMA_EnableStream(DMA1, LL_DMA_STREAM_4);
    LL_SPI_Enable(SPI2);
   
    /* Waiting the end of Data transfer */
    while (!LL_DMA_IsActiveFlag_TC4(DMA1));
    while (!LL_DMA_IsActiveFlag_TC3(DMA1));
    
    
    w5500_cs_deselect();
    LL_DMA_ClearFlag_TC4(DMA1);
    LL_DMA_ClearFlag_TC3(DMA1);
    
    LL_SPI_DisableDMAReq_RX(SPI2);
    LL_SPI_DisableDMAReq_TX(SPI2);  
    LL_SPI_Disable(SPI2);    
    
    memcpy(pRxBuf, pTmpBuf2 + 3, rx_len);
	
//	rt_sem_release(&w5500_sem);
}

/**
  * @brief : w5500 read data
  * @param : [dev] the device.
  * @param : [pos] the addr.
  * @param : [buffer] the pointer of data.
  * @param : [size] the size of data.
  * @return: [RT_EOK]/[RT_ERROR]
  * @updata: [2017-12-21][Sunxr][newly increased]
  */
//static rt_size_t rt_hw_w5500_read(rt_device_t dev, rt_off_t addr, void* buffer, rt_size_t size) 
//{
//    rt_spi_w5500_device_t w5500_dev;
//    
//    w5500_dev = (struct spi_w5500_device *)dev;
//    
//    rt_spi_transfer(w5500_dev->spi_device,NULL,buffer,size);

//    return(RT_EOK);	
//}

/**
  * @brief : w5500 write data
  * @param : [dev] the device.
  * @param : [pos] the addr.
  * @param : [buffer] the pointer of data.
  * @param : [size] the size of data.
  * @return: [RT_EOK]/[RT_ERROR]
  * @updata: [2017-12-21][Sunxr][newly increased]
  */
//static rt_size_t rt_hw_w5500_write(rt_device_t dev, rt_off_t addr, const void* buffer, rt_size_t size) 
//{
//    rt_spi_w5500_device_t w5500_dev;
//    
//    w5500_dev = (struct spi_w5500_device *)dev;
//    
//    rt_spi_transfer(w5500_dev->spi_device,buffer,NULL,size);

//    return(RT_EOK);		
//}

uint8_t SPI2_SendByte(uint8_t txData)
{
    uint8_t rxdata;    
    while (!LL_SPI_IsActiveFlag_TXE(SPI2));
    LL_SPI_TransmitData8(SPI2, txData);
    
    while (!LL_SPI_IsActiveFlag_RXNE(SPI2));
    rxdata = LL_SPI_ReceiveData8(SPI2);    
    return rxdata;
}

uint8_t  IINCHIP_SpiSendData(uint8_t dat)
{
    //rt_sem_take(&w5500_sem, RT_WAITING_FOREVER);
    
	return( SPI2_SendByte(dat));
	
	//rt_sem_release(&w5500_sem);
}

/* PUBLIC FUNCTION PROTOTYPES ------------------------------------------------*/
/**
  * @brief Read the device of w5500.
  * @param [AddrSel] The address command.
  * @retval Return the byte has been readed.
  */
uint8_t WIZCHIP_READ(uint32_t AddrSel)
{
    uint8_t ret;

    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if  ( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_ )
   	   AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_VDM_OP_);
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
   	   AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_FDM_OP_LEN1_);
   #else
      #error "Unsupported _WIZCHIP_IO_SPI_ in W5500 !!!"
   #endif
#if   !defined(SPI_DMA) 
//    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
//    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
//    WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
//    ret = WIZCHIP.IF.SPI._read_byte();
   IINCHIP_SpiSendData( (AddrSel & 0x00FF0000)>>16);// Address byte 1
   IINCHIP_SpiSendData( (AddrSel & 0x0000FF00)>> 8);// Address byte 2
   IINCHIP_SpiSendData( (AddrSel & 0x000000F8))    ;// Data read command and Read data length 1
   ret = IINCHIP_SpiSendData(0x00);             // Data read (read 1byte data)	
#else
   uint8_t spi_data[3];
   spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
   spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
   spi_data[2] = (AddrSel & 0x000000F8);
   spi_dma_read(spi_data, &ret, 1);
#endif   

#elif ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_))

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5000. !!!"   
#endif

   WIZCHIP.CS._deselect();
   WIZCHIP_CRITICAL_EXIT();
	 
   return(ret);
}

/**
  * @brief Write to the w5500 device.
  * @param [AddrSel] The address command.
  * @param [wb] The data which will been writen to w5500.
  * @retval None.
  */
void WIZCHIP_WRITE(uint32_t AddrSel, uint8_t wb)
{
    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_)
   	   AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_VDM_OP_);
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
   	   AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_FDM_OP_LEN1_);
   #else
      #error "Unsupported _WIZCHIP_IO_SPI_ in W5500 !!!"
   #endif

#if   !defined(SPI_DMA)	
//	WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
//	WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
//	WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
//	WIZCHIP.IF.SPI._write_byte(wb);
   IINCHIP_SpiSendData((AddrSel & 0x00FF0000)>>16);// Address byte 1
   IINCHIP_SpiSendData((AddrSel & 0x0000FF00)>> 8);// Address byte 2
   IINCHIP_SpiSendData((AddrSel & 0x000000F8) + 4);    // Data write command and Write data length 1
   IINCHIP_SpiSendData(wb); 	
#else
   uint8_t spi_data[3];
   spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
   spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
   spi_data[2] =  (AddrSel & 0x000000F8) + 4;
   spi_dma_write(spi_data, &wb, 1);
#endif   

#elif ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_))

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5500. !!!"
#endif

    WIZCHIP.CS._deselect();
    WIZCHIP_CRITICAL_EXIT();
}
         
/**
  * @brief Read the buffer of w5500 device.
  * @param [AddrSel] The address command.
  * @param [pBuf] The buffer pointer.
  * @param [len] The data length.
  * @retval None.
  */
void WIZCHIP_READ_BUF (uint32_t AddrSel, uint8_t* pBuf, uint16_t len)
{
//    uint16_t i = 0;
    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if ((_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

