jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/drivers/drv_w5500.c
   #if (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_)
      AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_VDM_OP_);

	#if   !defined(SPI_DMA) 
//   	  WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
//      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
//      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
//      for (i = 0; i < len; i++)
//	    {
//			    pBuf[i] = WIZCHIP.IF.SPI._read_byte();
//			}
		IINCHIP_SpiSendData( (AddrSel & 0x00FF0000)>>16);		// 通过SPI发送16位地址段给MCU
		IINCHIP_SpiSendData( (AddrSel & 0x0000FF00)>> 8);		// 
		IINCHIP_SpiSendData( (AddrSel & 0x000000F8));    		// 设置SPI为读操作
		for(i = 0; i < len; i++)                    	// 将buf中的数据通过SPI发送给MCU
		{
		    pBuf[i] = IINCHIP_SpiSendData(0x00);
		}	
	#else
		uint8_t spi_data[3];
		spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
		spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
		spi_data[2] = (AddrSel & 0x000000F8);
		spi_dma_read(spi_data, pBuf, len);  
	#endif
			
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
      AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_FDM_OP_LEN4_);
      for (i = 0; i < len/4; i++, j)
      {
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
          pBuf[i*4]   = WIZCHIP.IF.SPI._read_byte();
          pBuf[i*4+1] = WIZCHIP.IF.SPI._read_byte();
          pBuf[i*4+2] = WIZCHIP.IF.SPI._read_byte();            
          pBuf[i*4+3] = WIZCHIP.IF.SPI._read_byte();            
          AddrSel = WIZCHIP_OFFSET_INC(AddrSel,4);
      }
      len %= 4; // for the rest data
      // M20131220 : remove for loop
      i *= 4;        
      if (len >= 2)
      {
          AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN4_ to _W5500_SPI_FDM_OP_LEN2_

       //for (j = 0; j < len/2 ; j++)
          {
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
              pBuf[i]   = WIZCHIP.IF.SPI._read_byte();
              pBuf[i+1] = WIZCHIP.IF.SPI._read_byte();
              i += 2;
              AddrSel = WIZCHIP_OFFSET_INC(AddrSel,2);
          }
      }
      len %= 2;
      if (len)
      {
          AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN2_ to _W5500_SPI_FDM_OP_LEN1_
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
          pBuf[i]   = WIZCHIP.IF.SPI._read_byte();
      }      
   #else
      #error "Unsupported _WIZCHIP_IO_MODE_SPI_ in W5500 !!!"
   #endif

#elif ( (_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_) )

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5500. !!!!"
#endif

    WIZCHIP.CS._deselect();
    WIZCHIP_CRITICAL_EXIT();
}

/**
  * @brief Write the buffer to w5500 device.
  * @param [AddrSel] The address command.
  * @param [pBuf] The buffer pointer.
  * @param [len] The data length.
  * @retval None.
  */
void WIZCHIP_WRITE_BUF(uint32_t AddrSel, uint8_t* pBuf, uint16_t len)
{
//    uint16_t i = 0;
//    uint16_t j = 0;
    WIZCHIP_CRITICAL_ENTER();
    WIZCHIP.CS._select();

#if( (_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_SPI_))

   #if  ( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_VDM_ )
      AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_VDM_OP_);

   #if   !defined(SPI_DMA) 
//   	  WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
//      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
//      WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
//	
//      for (i = 0; i < len; i++)
//	    {
//          WIZCHIP.IF.SPI._write_byte(pBuf[i]);
//			}
	   IINCHIP_SpiSendData( (AddrSel & 0x00FF0000)>>16);// Address byte 1
	   IINCHIP_SpiSendData( (AddrSel & 0x0000FF00)>> 8);// Address byte 2
	   IINCHIP_SpiSendData( (AddrSel & 0x000000F8) + 4);    // Data write command and Write data length 1
	   for(i = 0; i < len; i++)                // Write data in loop
	   {
		   IINCHIP_SpiSendData(pBuf[i]);
	   }	
	#else
	   uint8_t spi_data[3];
	   spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
	   spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
	   spi_data[2] = (AddrSel & 0x000000F8) + 4;
	   spi_dma_write(spi_data, pBuf, len);  
	#endif   
			
   #elif( _WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_SPI_FDM_ )
      AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_FDM_OP_LEN4_);
			
      for (i = 0; i < len/4; i++)
      {
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
          WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4]  );
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4+1]);
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4+2]);            
          WIZCHIP.IF.SPI._write_byte(pBuf[i*4+3]);            
          AddrSel = WIZCHIP_OFFSET_INC(AddrSel,4);
      }
			
      len %= 4;      // for the rest data
      // M20131220 : Remove for loop
      i *= 4;
      if (len >= 2)
      {
          AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN4_ to _W5500_SPI_FDM_OP_LEN2_

       //for (j = 0; j < len/2 ; j++)
          {
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
              WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
              WIZCHIP.IF.SPI._write_byte(pBuf[i]  );
              WIZCHIP.IF.SPI._write_byte(pBuf[i+1]);
              i += 2;
               AddrSel = WIZCHIP_OFFSET_INC(AddrSel, 2);
          }
         len %= 2;
         if (len)
         {
             AddrSel -= 1;  // change _W5500_SPI_FDM_OP_LEN2_ to _W5500_SPI_FDM_OP_LEN1_
             WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
             WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
             WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
             WIZCHIP.IF.SPI._write_byte(pBuf[i]);
         }      
      }
   #else
      #error "Unsupported _WIZCHIP_IO_SPI_ in W5500 !!!"
   #endif

#elif ( (_WIZCHIP_IO_MODE_ & _WIZCHIP_IO_MODE_BUS_) )

   #if  (_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_DIR_)

   #elif(_WIZCHIP_IO_MODE_ == _WIZCHIP_IO_MODE_BUS_INDIR_)

   #else
      #error "Unsupported _WIZCHIP_IO_MODE_BUS_ in W5500 !!!"
   #endif
#else
   #error "Unknown _WIZCHIP_IO_MODE_ in W5500. !!!!"
#endif

    WIZCHIP.CS._deselect();
    WIZCHIP_CRITICAL_EXIT();
}

/**
  * @brief Get the TX_FSR of w5500 device.
  * @param [sn] The sn number.
  * @retval None.
  */
uint16_t getSn_TX_FSR(uint8_t sn)
{
    uint16_t val = 0, val1 = 0;
    do
    {
        val1 = WIZCHIP_READ(Sn_TX_FSR(sn));
        val1 = (val1 << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_TX_FSR(sn), 1));
        if (val1 != 0)
        {
            val = WIZCHIP_READ(Sn_TX_FSR(sn));
            val = (val << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_TX_FSR(sn), 1));
        }
    } while (val != val1);
		
    return(val);
}

/**
  * @brief Get the RX_RSR of w5500 device.
  * @param [sn] The sn number.
  * @retval None.
  */
uint16_t getSn_RX_RSR(uint8_t sn)
{
    uint16_t val = 0, val1 = 0;
    do
    {
        val1 = WIZCHIP_READ(Sn_RX_RSR(sn));
        val1 = (val1 << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_RX_RSR(sn), 1));
        if (val1 != 0)
        {
            val = WIZCHIP_READ(Sn_RX_RSR(sn));
            val = (val << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_RX_RSR(sn), 1));
        }
    } while (val != val1);
		
    return(val);
}

/**
  * @brief Send data through w5500 device.
  * @param [sn] The sn number.
  * @param [wizdata] The data pointer.
  * @param [len] The length of data.
  * @retval None.
  */
void wiz_send_data(uint8_t sn, uint8_t *wizdata, uint16_t len)
{
    uint16_t ptr = 0;
    uint32_t addrsel = 0;
	
    if (len != 0)
    {
        ptr = getSn_TX_WR(sn);
        // M20140501 : implict type casting -> explict type casting
        // addrsel = (ptr << 8) + (WIZCHIP_TXBUF_BLOCK(sn) << 3);
        addrsel = ((uint32_t)ptr << 8) + (WIZCHIP_TXBUF_BLOCK(sn) << 3);

        WIZCHIP_WRITE_BUF(addrsel, wizdata, len);
   
