jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/drivers/drv_w5500.c
        ptr += len;
        setSn_TX_WR(sn, ptr);
    }
}

/**
  * @brief Send data through w5500 device.
  * @param [sn] The sn number.
  * @param [wizdata] The data pointer.
  * @param [len] The length of data.
  * @retval None.
  */
void wiz_recv_data(uint8_t sn, uint8_t *wizdata, uint16_t len)
{
    uint16_t ptr = 0;
    uint32_t addrsel = 0;
   
    if (len != 0) 
    {
        ptr = getSn_RX_RD(sn);
        // M20140501 : implict type casting -> explict type casting
        // addrsel = ((ptr << 8) + (WIZCHIP_RXBUF_BLOCK(sn) << 3);
        addrsel = ((uint32_t)ptr << 8) + (WIZCHIP_RXBUF_BLOCK(sn) << 3);

        WIZCHIP_READ_BUF(addrsel, wizdata, len);
        ptr += len;
   
        setSn_RX_RD(sn,ptr);
    }
}

/**
  * @brief Receive data from w5500 device.
  * @param [sn] The sn number.
  * @param [len] The length of data.
  * @retval None.
  */
void wiz_recv_ignore(uint8_t sn, uint16_t len)
{
    uint16_t ptr = 0;
    ptr = getSn_RX_RD(sn);
    ptr += len;
    setSn_RX_RD(sn,ptr);
}

/**
  * @brief : SPI4 initialization. 
  * @param : [none]
  * @return: [RT_ERROR] error;[RT_EOK] successful.
  */
//int rt_hw_spi2_init(void)
//{
//    /* register spi bus */
//    {
//        GPIO_InitTypeDef GPIO_InitStructure;
//        rt_err_t result;

//        __HAL_RCC_GPIOI_CLK_ENABLE(); // enable GPIOI clock
//			
//        GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3;
//        GPIO_InitStructure.Alternate = GPIO_AF5_SPI2; 
//        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP; 
//        GPIO_InitStructure.Pull = GPIO_PULLUP; 
//        GPIO_InitStructure.Speed = GPIO_SPEED_FAST;                    
//        HAL_GPIO_Init(GPIOI, &GPIO_InitStructure);

////        result = stm32_spi_bus_register(SPI2, 0, "spi2");
//        result = stm32_spi_bus_register(SPI2, 0, RT_SPI2_BUS_NAME);
//        if (result != RT_EOK)
//        {
//            return(result);
//        }
//    }

//    /* attach cs */
//    {
//        static struct rt_spi_device spi_device;
//        rt_err_t result;

////        result = rt_spi_bus_attach_device(&spi_device, "spi20", "spi2", NULL);
//        result = rt_spi_bus_attach_device(&spi_device, RT_SPI2_DEVICE_NAME, RT_SPI2_BUS_NAME, NULL);
//        if (result != RT_EOK)
//        {
//            return(result);
//        }
//    }
//		
//    return(RT_EOK);
//}
//INIT_BOARD_EXPORT(rt_hw_spi2_init);

///**
//  * @brief : w5500 hardware init
//  * @param : [param] the parameter.
//  * @return: [RT_EOK] 
//  * @updata: [2017-12-21][Sunxr][newly increased]
//  */
//int rt_hw_w5500_spi_init(void)
//{	
//    struct rt_spi_configuration cfg;	
//    rt_spi_w5500_device_t w5500_dev = (rt_spi_w5500_device_t) rt_malloc(sizeof(struct spi_w5500_device));
//	
//    /* SPI configure */
//    w5500_dev->spi_device = (struct rt_spi_device *) rt_device_find(RT_SPI2_DEVICE_NAME);
//	
//    if (w5500_dev->spi_device == NULL)
//    {
//        W5500_PRINTF("spi2 bus device spi20 not found! w5500 init failed \r\n"); 
//		
//        return(RT_ERROR);
//    }
//    cfg.mode = RT_SPI_MODE_MASK;
//    cfg.max_hz = 45 * 1000 * 1000;
//    cfg.data_width = 8;	
//    rt_spi_configure(w5500_dev->spi_device, &cfg);	
//	
//    /* initialize lock */
//    rt_mutex_init(&(w5500_dev->lock), "w5500", RT_IPC_FLAG_FIFO);	
//	
//    /* register device */
//    w5500_dev->w5500_device.type = RT_Device_Class_SPIDevice;
//    w5500_dev->w5500_device.init = RT_NULL;
//    w5500_dev->w5500_device.open = RT_NULL;
//    w5500_dev->w5500_device.close = RT_NULL;
//    w5500_dev->w5500_device.read = rt_hw_w5500_read;
//    w5500_dev->w5500_device.write = rt_hw_w5500_write;
//    w5500_dev->w5500_device.control = RT_NULL;	
//    /* no private */
//    w5500_dev->w5500_device.user_data = RT_NULL;
//	
//    rt_device_register(&(w5500_dev->w5500_device), RT_SPI_ETH_NAME, RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_STANDALONE);	
//	
//    return(RT_EOK);
//}
//INIT_PREV_EXPORT(rt_hw_w5500_spi_init)

/**
  * @brief : the Interrupt service of sd2405
  * @param : [args]-entrance parameter pointer
  * @return: [none]
  * @updata: [2018-01-14][Sunxr][newly increased]
  */
static void rt_hw_w5500_irq_service(void *args)
{
    if (!(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_3)))
    { 
	  #if RT_USING_W5500            
		//rt_sem_release(&w5500_rec_irq_sem);
		rt_event_send(&w5500_event, EVENT_REC_IRQ_W5500);
	  #endif /* RT_USING_W5500 */ 	
    }    
}

/**
  * @brief : read one byte through SPI2.
  * @param : none.
  * @return: Return the reading data.
  * @updata: [2017-12-07][Lexun][make the code cleanup]
  */  
uint8_t w5500_ReadByte(void)
{	
    uint8_t rxdata;    
    
//    while (!LL_SPI_IsActiveFlag_RXNE(SPI2));
    rxdata = LL_SPI_ReceiveData8(SPI2);    
    return rxdata;	
//	unsigned char Rxdata = 0;
//	rt_device_read((rt_device_t)device_w5500.spi_device, NULL, &Rxdata, 1);
//	return (unsigned char)Rxdata;
}

/**
  * @brief : write one byte through SPI2.
  * @param : [TxData] writing data.
  * @return: none.
  * @updata: [2017-12-07][Lexun][make the code cleanup]
  */  
void w5500_WriteByte(uint8_t TxData)
{
//    while (!LL_SPI_IsActiveFlag_TXE(SPI2));
    LL_SPI_TransmitData8(SPI2, TxData);	
//    rt_device_write((rt_device_t)device_w5500.spi_device, NULL, &TxData, 1);  
}

void spi_dma_init(void)
{    
    LL_DMA_InitStructure_Write.FIFOMode = LL_DMA_FIFOMODE_DISABLE;
    LL_DMA_InitStructure_Write.FIFOThreshold = LL_DMA_FIFOTHRESHOLD_1_4;
    LL_DMA_InitStructure_Write.MemBurst = DMA_MBURST_SINGLE;
    LL_DMA_InitStructure_Write.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE;
    LL_DMA_InitStructure_Write.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    LL_DMA_InitStructure_Write.Mode = LL_DMA_MODE_NORMAL;
    
    LL_DMA_InitStructure_Write.PeriphOrM2MSrcAddress = (uint32_t)(&(SPI2->DR));
    LL_DMA_InitStructure_Write.PeriphBurst = DMA_PBURST_SINGLE;
    LL_DMA_InitStructure_Write.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE;
    LL_DMA_InitStructure_Write.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE;
    LL_DMA_InitStructure_Write.PeriphOrM2MSrcIncMode =  LL_DMA_PERIPH_NOINCREMENT;
    LL_DMA_InitStructure_Write.Priority = LL_DMA_PRIORITY_HIGH;   
    
    LL_DMA_InitStructure.FIFOMode = LL_DMA_FIFOMODE_ENABLE;
    LL_DMA_InitStructure.FIFOThreshold = LL_DMA_FIFOTHRESHOLD_1_4;
    LL_DMA_InitStructure.MemBurst = DMA_MBURST_SINGLE;
    LL_DMA_InitStructure.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE;
    LL_DMA_InitStructure.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    LL_DMA_InitStructure.Mode = LL_DMA_MODE_NORMAL;
    
